In [44]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [45]:
df =pd.DataFrame(randn(4,3),["a","s","d","f"],["clm1","clm2","clm3"])

In [46]:
df

       clm1      clm2      clm3
a -0.653050 -0.083554  1.181980
s -1.559627 -0.609108  1.552880
d  1.135206 -0.360328 -1.526333
f -1.495328  2.738518  0.045728

In [47]:
df>-1

    clm1  clm2   clm3
a   True  True   True
s  False  True   True
d   True  True  False
f  False  True   True

In [48]:
df>0

    clm1   clm2   clm3
a  False  False   True
s  False  False   True
d   True  False  False
f  False   True   True

In [49]:
booleanDf = df> 0

In [50]:
booleanDf

    clm1   clm2   clm3
a  False  False   True
s  False  False   True
d   True  False  False
f  False   True   True

In [51]:
df[booleanDf]

       clm1      clm2      clm3
a       NaN       NaN  1.181980
s       NaN       NaN  1.552880
d  1.135206       NaN       NaN
f       NaN  2.738518  0.045728

In [52]:
df[df>0]

       clm1      clm2      clm3
a       NaN       NaN  1.181980
s       NaN       NaN  1.552880
d  1.135206       NaN       NaN
f       NaN  2.738518  0.045728

In [53]:
df[df >-2]

       clm1      clm2      clm3
a -0.653050 -0.083554  1.181980
s -1.559627 -0.609108  1.552880
d  1.135206 -0.360328 -1.526333
f -1.495328  2.738518  0.045728

In [54]:
df

       clm1      clm2      clm3
a -0.653050 -0.083554  1.181980
s -1.559627 -0.609108  1.552880
d  1.135206 -0.360328 -1.526333
f -1.495328  2.738518  0.045728

In [55]:
df["clm1"]

a   -0.653050
s   -1.559627
d    1.135206
f   -1.495328
Name: clm1, dtype: float64

In [56]:
df["clm1"]>0

a    False
s    False
d     True
f    False
Name: clm1, dtype: bool

In [57]:
df["clm1"]>0.5

a    False
s    False
d     True
f    False
Name: clm1, dtype: bool

In [58]:
df[df["clm1"]>0.5]

       clm1      clm2      clm3
d  1.135206 -0.360328 -1.526333

In [59]:
df[df["clm2"]>0]

       clm1      clm2      clm3
f -1.495328  2.738518  0.045728

In [60]:
df[df["clm2"]>0.5]

       clm1      clm2      clm3
f -1.495328  2.738518  0.045728

In [20]:
df[(df["clm1"]>0)&(df["clm2"]>0)]

       clm1      clm2      clm3
s  1.059803  0.363373  0.878383
f  2.870369  1.102810  0.540376

In [21]:
df[(df["clm1"]>0)|(df["clm2"]>0)]

       clm1      clm2      clm3
s  1.059803  0.363373  0.878383
f  2.870369  1.102810  0.540376

In [22]:
df

       clm1      clm2      clm3
a -1.635913 -0.492084  0.623808
s  1.059803  0.363373  0.878383
d -0.589269 -0.684957  0.810224
f  2.870369  1.102810  0.540376

In [23]:
df["clm4"] = pd.Series(randn(4),["a","s","d","f"])

In [24]:
df

       clm1      clm2      clm3      clm4
a -1.635913 -0.492084  0.623808 -0.894543
s  1.059803  0.363373  0.878383  0.830696
d -0.589269 -0.684957  0.810224 -1.044319
f  2.870369  1.102810  0.540376  0.858858

In [25]:
df ["clm5"] =randn(4)

In [26]:
df

       clm1      clm2      clm3      clm4      clm5
a -1.635913 -0.492084  0.623808 -0.894543 -1.016589
s  1.059803  0.363373  0.878383  0.830696  0.266721
d -0.589269 -0.684957  0.810224 -1.044319 -0.854090
f  2.870369  1.102810  0.540376  0.858858  0.007531

In [27]:
df["clm6"] = ["newValue1","newValue2","newValue3","newValue4"]

In [28]:
df

       clm1      clm2      clm3      clm4      clm5       clm6
a -1.635913 -0.492084  0.623808 -0.894543 -1.016589  newValue1
s  1.059803  0.363373  0.878383  0.830696  0.266721  newValue2
d -0.589269 -0.684957  0.810224 -1.044319 -0.854090  newValue3
f  2.870369  1.102810  0.540376  0.858858  0.007531  newValue4

In [29]:
df.set_index("clm6")

               clm1      clm2      clm3      clm4      clm5
clm6
newValue1 -1.635913 -0.492084  0.623808 -0.894543 -1.016589
newValue2  1.059803  0.363373  0.878383  0.830696  0.266721
newValue3 -0.589269 -0.684957  0.810224 -1.044319 -0.854090
newValue4  2.870369  1.102810  0.540376  0.858858  0.007531

In [30]:
df

       clm1      clm2      clm3      clm4      clm5       clm6
a -1.635913 -0.492084  0.623808 -0.894543 -1.016589  newValue1
s  1.059803  0.363373  0.878383  0.830696  0.266721  newValue2
d -0.589269 -0.684957  0.810224 -1.044319 -0.854090  newValue3
f  2.870369  1.102810  0.540376  0.858858  0.007531  newValue4

In [31]:
df.set_index("clm6",inplace = True)

In [32]:
df

               clm1      clm2      clm3      clm4      clm5
clm6
newValue1 -1.635913 -0.492084  0.623808 -0.894543 -1.016589
newValue2  1.059803  0.363373  0.878383  0.830696  0.266721
newValue3 -0.589269 -0.684957  0.810224 -1.044319 -0.854090
newValue4  2.870369  1.102810  0.540376  0.858858  0.007531

In [33]:
df.index.names

FrozenList(['clm6'])

##  Multiindex

In [34]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [35]:
outer_Index = ["Group1","Group1","Group1","Group2","Group2","Group2","Group3","Group3","Group3"]

In [36]:
inner_Index = ["Index1","Index2","Index3","Index1","Index2","Index3","Index1","Index2","Index3"]

In [37]:
zip(outer_Index,inner_Index)

In [38]:
list(zip(outer_Index,inner_Index))

[('Group1', 'Index1'),
 ('Group1', 'Index2'),
 ('Group1', 'Index3'),
 ('Group2', 'Index1'),
 ('Group2', 'Index2'),
 ('Group2', 'Index3'),
 ('Group3', 'Index1'),
 ('Group3', 'Index2'),
 ('Group3', 'Index3')]

In [62]:
hierarchy = list(zip(outer_Index,inner_Index))

In [65]:
hierarchy = pd.MultiIndex.from_tuples(hierarchy)

In [66]:
# there is a problem
hierarchy

MultiIndex([('Group1', 'Index1'),
            ('Group1', 'Index2'),
            ('Group1', 'Index3'),
            ('Group2', 'Index1'),
            ('Group2', 'Index2'),
            ('Group2', 'Index3'),
            ('Group3', 'Index1'),
            ('Group3', 'Index2'),
            ('Group3', 'Index3')],
           )

In [68]:
df =pd.DataFrame(randn(9,3),hierarchy,columns = ["clm1","clm2","clm3"])

In [69]:
df

                   clm1      clm2      clm3
Group1 Index1 -0.207797 -0.205801  1.954585
       Index2 -0.063953 -0.995883  0.653785
       Index3 -0.764078  1.248684  0.698026
Group2 Index1  0.473158 -0.579226 -0.193627
       Index2  0.008845 -0.888911  0.986472
       Index3 -1.757368 -0.285423  0.072651
Group3 Index1 -0.244950 -1.260088 -0.782749
       Index2  0.574077  0.402303  1.238368
       Index3 -0.469549  1.252905  0.013128

In [70]:
df["clm1"]

Group1  Index1   -0.207797
        Index2   -0.063953
        Index3   -0.764078
Group2  Index1    0.473158
        Index2    0.008845
        Index3   -1.757368
Group3  Index1   -0.244950
        Index2    0.574077
        Index3   -0.469549
Name: clm1, dtype: float64

In [71]:
df.loc["Group1"]

            clm1      clm2      clm3
Index1 -0.207797 -0.205801  1.954585
Index2 -0.063953 -0.995883  0.653785
Index3 -0.764078  1.248684  0.698026

In [72]:
df.loc["Group1"].loc["Index1"]

clm1   -0.207797
clm2   -0.205801
clm3    1.954585
Name: Index1, dtype: float64

In [73]:
df.loc["Group1"].loc["Index1"]["clm1"]

-0.20779739007940656

In [74]:
df

                   clm1      clm2      clm3
Group1 Index1 -0.207797 -0.205801  1.954585
       Index2 -0.063953 -0.995883  0.653785
       Index3 -0.764078  1.248684  0.698026
Group2 Index1  0.473158 -0.579226 -0.193627
       Index2  0.008845 -0.888911  0.986472
       Index3 -1.757368 -0.285423  0.072651
Group3 Index1 -0.244950 -1.260088 -0.782749
       Index2  0.574077  0.402303  1.238368
       Index3 -0.469549  1.252905  0.013128

In [75]:
df.index.names

FrozenList([None, None])

In [76]:
df.index.names = ["Groups","Indexes"]

In [77]:
df

                    clm1      clm2      clm3
Groups Indexes
Group1 Index1  -0.207797 -0.205801  1.954585
       Index2  -0.063953 -0.995883  0.653785
       Index3  -0.764078  1.248684  0.698026
Group2 Index1   0.473158 -0.579226 -0.193627
       Index2   0.008845 -0.888911  0.986472
       Index3  -1.757368 -0.285423  0.072651
Group3 Index1  -0.244950 -1.260088 -0.782749
       Index2   0.574077  0.402303  1.238368
       Index3  -0.469549  1.252905  0.013128

In [80]:
df.loc["Group1"]

             clm1      clm2      clm3
Indexes
Index1  -0.207797 -0.205801  1.954585
Index2  -0.063953 -0.995883  0.653785
Index3  -0.764078  1.248684  0.698026

In [82]:
df.xs("Group1")

             clm1      clm2      clm3
Indexes
Index1  -0.207797 -0.205801  1.954585
Index2  -0.063953 -0.995883  0.653785
Index3  -0.764078  1.248684  0.698026

In [83]:
df.xs("Group2")

             clm1      clm2      clm3
Indexes
Index1   0.473158 -0.579226 -0.193627
Index2   0.008845 -0.888911  0.986472
Index3  -1.757368 -0.285423  0.072651

In [85]:
df.xs("Group2").xs("Index2").xs("clm2")

-0.8889110993531667

In [86]:
df.xs("Group3").xs("Index3").xs("clm3")

0.01312780365085509

In [87]:
df.xs("Index1", level = "Indexes")

            clm1      clm2      clm3
Groups
Group1 -0.207797 -0.205801  1.954585
Group2  0.473158 -0.579226 -0.193627
Group3 -0.244950 -1.260088 -0.782749